app/Controllers/Auth.php

    public function loginProcess()
    {
        $userModel = new UserModel();

        $user = $userModel->where('username', $this->request->getPost('username'))->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1