app/Controllers/Dashboard.php

    public function index()
    {

        $siswa = new SiswaModel();
        $kelompok = new KelompokModel();

        $data = [
            'title' => 'Dashboard',
            'totalSiswa' => $siswa->countAll(),
---
SELECT COUNT(*) AS `numrows` FROM `siswa`