app/Controllers/Kelompok.php

SELECT `kelompok_pkl`.*, `pembimbing_sekolah`.`nama` as `ps`, `pembimbing_univ`.`nama` as `pu`
FROM `kelompok_pkl`
LEFT JOIN `pembimbing_sekolah` ON `pembimbing_sekolah`.`id_pembimbing_sekolah` = `kelompok_pkl`.`id_pembimbing_sekolah`
LEFT JOIN `pembimbing_univ` ON `pembimbing_univ`.`id_pembimbing_univ` = `kelompok_pkl`.`id_pembimbing_univ`
---
    public function index()
    {
        $data['kelompok'] = $this->kelompokModel
            ->select('kelompok_pkl.*, pembimbing_sekolah.nama as ps, pembimbing_univ.nama as pu')
            ->join('pembimbing_sekolah', 'pembimbing_sekolah.id_pembimbing_sekolah = kelompok_pkl.id_pembimbing_sekolah', 'left')
            ->join('pembimbing_univ', 'pembimbing_univ.id_pembimbing_univ = kelompok_pkl.id_pembimbing_univ', 'left')
            ->findAll();