app/Controllers/PembimbingSekolah.php

SELECT *
FROM `pembimbing_sekolah`
---
    public function index()
    {
        return view('pembimbingsekolah/index', ['pembimbing' => $this->model->findAll()]);