app/Controllers/PembimbingUniv.php

SELECT *
FROM `pembimbing_univ`
---
    public function index()
    {
        return view('pembimbinguniv/index', ['pembimbing' => $this->model->findAll()]);