app/Controllers/Penilaian.php

    public function index()
    {
        $data['penilaian'] = $this->model
            ->select('penilaian_pkl.*,
         siswa.nama AS nama_siswa,
         pembimbing_univ.nama AS nama_pembimbing_univ,
         pembimbing_sekolah.nama AS nama_pembimbing_sekolah,
         kelompok_pkl.nama_kelompok AS nama_kelompok')
            ->join('siswa', 'siswa.id_siswa = penilaian_pkl.id_siswa')
            ->join('kelompok_pkl', 'kelompok_pkl.id_kelompok = siswa.id_kelompok', 'left')
            ->join('pembimbing_univ', 'pembimbing_univ.id_pembimbing_univ = penilaian_pkl.id_pembimbing_univ', 'left')
            ->join('pembimbing_sekolah', 'pembimbing_sekolah.id_pembimbing_sekolah = penilaian_pkl.id_pembimbing_sekolah', 'left')

            ->findAll();
---
SELECT `penilaian_pkl`.*, `siswa`.`nama` AS `nama_siswa`, `pembimbing_univ`.`nama` AS `nama_pembimbing_univ`, `pembimbing_sekolah`.`nama` AS `nama_pembimbing_sekolah`, `kelompok_pkl`.`nama_kelompok` AS `nama_kelompok`
FROM `penilaian_pkl`
JOIN `siswa` ON `siswa`.`id_siswa` = `penilaian_pkl`.`id_siswa`
LEFT JOIN `kelompok_pkl` ON `kelompok_pkl`.`id_kelompok` = `siswa`.`id_kelompok`
LEFT JOIN `pembimbing_univ` ON `pembimbing_univ`.`id_pembimbing_univ` = `penilaian_pkl`.`id_pembimbing_univ`
LEFT JOIN `pembimbing_sekolah` ON `pembimbing_sekolah`.`id_pembimbing_sekolah` = `penilaian_pkl`.`id_pembimbing_sekolah`