app/Controllers/Siswa.php

SELECT `siswa`.*, `kelompok_pkl`.`nama_kelompok`
FROM `siswa`
LEFT JOIN `kelompok_pkl` ON `kelompok_pkl`.`id_kelompok` = `siswa`.`id_kelompok`
---
    public function index()
    {
        $data['siswa'] = $this->siswaModel->select('siswa.*, kelompok_pkl.nama_kelompok')
            ->join('kelompok_pkl', 'kelompok_pkl.id_kelompok = siswa.id_kelompok', 'left')
            ->findAll();